app/controllers/categories_controller.rb

    def index
        @categories = Category.joins(:products).select('categories.*, count(products.id) as products_count').group('categories.id').order(:title)
---
SELECT COUNT(*) FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1  [["category_id", 1]]
SELECT COUNT(categories.*, count(products.id) as products_count) AS count_categories_all_count_products_id_as_products_count, "categories"."id" AS categories_id FROM "categories" INNER JOIN "product_categories" ON "product_categories"."category_id" = "categories"."id" INNER JOIN "products" ON "products"."id" = "product_categories"."product_id" GROUP BY "categories"."id" ORDER BY "categories"."title" ASC
SELECT categories.*, count(products.id) as products_count FROM "categories" INNER JOIN "product_categories" ON "product_categories"."category_id" = "categories"."id" INNER JOIN "products" ON "products"."id" = "product_categories"."product_id" GROUP BY "categories"."id" ORDER BY "categories"."title" ASC