app/controllers/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "products".* FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1 ORDER BY "products"."title" ASC  [["category_id", 5]]
---
    def index
        @category = Category.find(params[:category_id])
        @products = @category.products.includes(:product_variants).order(:title)