app/models/shopping_cart.rb

    def order
        @order ||= Order.find_or_create_by(token: @token) do |order|
---
INSERT INTO "orders" ("sub_total", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_total", "0.0"], ["created_at", "2021-06-04 21:39:05.081889"], ["updated_at", "2021-06-04 21:39:05.081889"], ["token", "661420f50b61c367"]]
SELECT "orders".* FROM "orders" WHERE "orders"."token" = $1 LIMIT $2  [["token", "661420f50b61c367"], ["LIMIT", 1]]

    def add_item(product_id:, quantity: 1)
        product = Product.find(product_id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]