app/views/categories/index.html.erb

SELECT COUNT(*) FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1  [["category_id", 5]]
---
            <%= category.title %>
            (<%= category.products.count %> produtos)