app/views/products/index.html.erb

            <ul>
                <% product.product_variants.each do |variant| %>
---
SELECT "product_variants".* FROM "product_variants" WHERE "product_variants"."product_id" = $1  [["product_id", 5]]